## <span style="text-transform:uppercase">staging</span> Module: etl_lambdas
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`  


```terraform
Plan: 12 to add, 0 to change, 0 to destroy
```

<details>
  <summary>Show Plan</summary>

  ```terraform
  
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.twice-a-day will be created
  + resource "aws_cloudwatch_event_rule" "twice-a-day" {
      + arn                 = (known after apply)
      + description         = "Fires twice a day"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "twice-a-day"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 6,18 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.tigger-masked_metrics will be created
  + resource "aws_cloudwatch_event_target" "tigger-masked_metrics" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "twice-a-day"
      + target_id      = "masked_metrics"
    }

  # aws_cloudwatch_event_target.tigger-unmasked_metrics will be created
  + resource "aws_cloudwatch_event_target" "tigger-unmasked_metrics" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "twice-a-day"
      + target_id      = "unmasked_metrics"
    }

  # aws_iam_policy.etl_policies will be created
  + resource "aws_iam_policy" "etl_policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "EtlLambdaAccess"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:GetItem",
                          + "dynamodb:ConditionCheckItem",
                          + "dynamodb:BatchGetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ca-central-1:005133826942:table/aggregate_metrics"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForlayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ca-central-1:005133826942:repository/covid-server/metrics-server"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:PutObjectAcl",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::unmasked-metrics-snfsv-staging/*",
                          + "arn:aws:s3:::unmasked-metrics-snfsv-staging",
                          + "arn:aws:s3:::masked-metrics-snfsv-staging/*",
                          + "arn:aws:s3:::masked-metrics-snfsv-staging",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.metrics_csv will be created
  + resource "aws_iam_role" "metrics_csv" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "metrics_csv_lambda_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.etl_policies will be created
  + resource "aws_iam_role_policy_attachment" "etl_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "metrics_csv_lambda_role"
    }

  # aws_lambda_permission.allow-cloudwatch-to-call-masked_metrics will be created
  + resource "aws_lambda_permission" "allow-cloudwatch-to-call-masked_metrics" {
      + action        = "lambda:InvokeFunction"
      + function_name = "masked_metrics"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # aws_lambda_permission.allow-cloudwatch-to-call-unmasked_metrics will be created
  + resource "aws_lambda_permission" "allow-cloudwatch-to-call-unmasked_metrics" {
      + action        = "lambda:InvokeFunction"
      + function_name = "unmasked_metrics"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # module.masked_metrics.aws_cloudwatch_log_group.metric_log will be created
  + resource "aws_cloudwatch_log_group" "metric_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/masked_metrics"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.masked_metrics.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + arn                            = (known after apply)
      + function_name                  = "masked_metrics"
      + id                             = (known after apply)
      + image_uri                      = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUCKET_NAME" = "masked-metrics-snfsv-staging"
              + "ENVIRONMENT" = "staging"
              + "MASK_DATA"   = "true"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-090d16d17a0b6c2b1",
            ]
          + subnet_ids         = [
              + "subnet-07f256fc1e9b65732",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.unmasked_metrics.aws_cloudwatch_log_group.metric_log will be created
  + resource "aws_cloudwatch_log_group" "metric_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/unmasked_metrics"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.unmasked_metrics.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + arn                            = (known after apply)
      + function_name                  = "unmasked_metrics"
      + id                             = (known after apply)
      + image_uri                      = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUCKET_NAME" = "unmasked-metrics-snfsv-staging"
              + "ENVIRONMENT" = "staging"
              + "MASK_DATA"   = "false"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-090d16d17a0b6c2b1",
            ]
          + subnet_ids         = [
              + "subnet-07f256fc1e9b65732",
            ]
          + vpc_id             = (known after apply)
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary"
  ```
</details>